Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/third_level_education/coming_to_ireland_to_study/efl_language_schools.html.txt.tmx
Source language: en
Languages: ga

source: Ireland is a popular destination for those interested in learning English
ga: Is áit choitianta í Éire le haghaidh daoine a mbíonn suim acu Béarla a fhoghlaim

source: There are many schools and courses available throughout the country that cater for everyone from business executives and students who want to improve their English language proficiency, to those who want to learn how to teach English as a foreign language
ga: Tá go leor scoileanna agus cúrsaí ar fud na tíre do gach duine, idir fheidhmeannaigh ghnó agus daltaí atá ag iarraidh feabhais a chur ar a gcuid Béarla agus daoine atá ag iarraidh foghlaim conas Béarla a mhúineadh mar theanga iasachta

source: The majority of English-as-a-foreign-language (EFL) schools in Ireland are privately run and provide students with a full package of tuition, homestay accommodation and extra-curricular activities
ga: Is scoileanna príobháideacha iad formhór na scoileanna Béarla mar theanga iasachta (EFL) in Éirinn agus ofráileann siad pacáiste lán, le teagasc, lóistín agus gníomhíochtaí sa bhreis ar churaclam san áireamh

source: The majority of schools offer preparation programmes for the major English language examinations, such as TOEFL, IELTS, Cambridge and Trinity College (London)
ga: Bíonn cúrsaí ullmhúcháin ag formhór na scoileanna seo do na mór-scrúduithe Béarla, ar nós TOEFL, IELTS, Cambridge agus Coláiste na Tríonóide (Londain)

source: TEFL (Teaching English as a Foreign Language) programmes are also available at many private schools and a number of universities (University College Dublin, University College Cork, NUI Galway, Dublin City University agus University of Limerick
ga: Tá cúrsaí TEFL (An Béarla a Mhúineadh mar Theanga Iasachta) ar fáil i go leor scoileanna príobháideacha agus roinnt Ollscoileanna (Ollscoil na hÉireann, BÁC, Ollscoil na hÉireann Corcaí, OÉ Gaillimh, Ollscoil Chathair Bhaile Átha Cliath agus Ollscoil Luimní

source: Accreditation and Co-ordination of English Language Services
ga: Creidiúnú agus Comhordú Seirbhísí Teagaisc an Bhéarla

source: It is important to ensure that high standards exist throughout the EFL sector and that courses in EFL schools in Ireland are comparable with other international courses
ga: Tá sé tábhachtach ardchaighdeán sa roinn EFL a chinntiú agus a dhéanamh deimhin de go bhfuil na cúrsaí sna scoileanna Éireannacha ar chomhchéim leis na cinn idirnáisiúnta

source: The Department of Education and Skills has given Accreditation and Co-ordination of English Language Services (ACELS) the responsibility for monitoring the EFL sector
ga: Thug an Roinn Oideachais agus Scileanna freagracht do Creidiúnú agus Comhordú Seirbhísí Teagaisc an Bhéarla (CCSTB) le féachaint i ndiaidh na rannóga EFL

source: Since January 2011 ACELS is part of Quality and Qualifications Ireland (QQI)
ga: Ó Eanáir 2011 is é CCSTB cuid den Dearbhú Cáilíochta agus Cáilíochtaí Éireann (DCCE)

source: The list of recognised EFL schools and organisations in Ireland is published on an annual basis and is available on the ACELS web site
ga: Foilsítear liosta na scoileanna agus eagraíochtaí aitheanta EFL in Éirinn ar bhonn bliantúil agus tá sé ar fáil ar shuíomh idirlín an CCSTB

source: Regulations governing EFL schools
ga: Rialacha ag baint le scoileanna EFL

source: New schools receive two inspection visits, 10 months apart
ga: Tugtar cuairt ar scoileanna nua faoi dhó le briseadh 10 mí idir an dá chuairt

source: ACELS will inspect existing schools at least once every three years to make sure that they are adhering to the regulations
ga: Bíonn scrúdú ag scoileanna aitheanta ar a laghad uair amháin i ngach 3 bliana chun a chinntiú go bhfuil siad ag cloí leis na rialacha

source: While this is normal practice, it has the authority to visit or inspect a school at all reasonable times
ga: Sin a tharlaíonn go hiondúil, ach is féidir le CCSTB cuairt a thabhairt ar scoil ag aon am réasúnta

source: ACELS has a number of criteria that it uses to determine if a school is worthy of official recognition, which includes the following:
ga: Tá critéir faoi leith ag CCSTB a n-úsáidtear chun scoileanna a mheas maidir le haitheantas oifigiúil

source: • All premises used by the school must comply with the Schedule of Required Standards prepared by ACELS
ga: • Caithfidh na háitribh aontú le Sceideal na gCaighdeán Riachtanach a bhíonn ullmhaithe ag CCSTB

source: These standards include local authority requirements in planning, construction, water supply, sewage disposal, fire precautions and general safety
ga: I measc na gcaighdeán seo tá riachtanais an Údaráis áitiúil ó thaobh pleanála, tógála, sóláthar uisce, córas séarachais, réamhchúram tine agus slándáil ghinearálta de

source: Schools must also be properly heated and ventilated and provide adequate facilities (learning and recreational) for students
ga: Caithfidh teas agus aerú ceart a bheith sna scoileanna chomh maith le háiseanna foghlamtha agus siamsaíochta do scoláirí

source: • Schools must have the correct public and employer liability insurance cover and all employment legislation and health and safety legislation must be complied with
ga: • Caithfidh scoileanna árachas cuí dliteanas phoiblí agus fostóra a bheith acu agus caithfidh siad cloí le reachtaíocht fhostaíochta agus reachtaíocht sláinte agus sábháilteachta

source: Safety statements and logs must be available for inspection
ga: Caithfidh ráitis sábháilteachta agus tuairiscí a bheith ar fáil le haghaidh scrúdaithe

source: • Schools must adhere to all the immigration requirements for students laid down by the Department of Justice and Equality
ga: • Caithfidh scoileanna cloí le riachtanais inimirce na ndaltaí mar atá leagtha síos ag an Roinn Dlí agus Cirt agus Comhionannais

source: • The courses provided by schools must be educationally sound and have content appropriate to their stated objectives
ga: • Ba cheart bonn maith oideachasúil a bheith ag na cúrsaí a chuireann na scoileanna ar fáil agus an t-ábhar a bheith oiriúnach dá gcuid cuspóirí luaite

source: • Course programmes should clearly state the number of tuition hours
ga: • Ba cheart méid uaireanta teagaisc na gcúrsaí a bheith curtha in iúl go soiléir ar an gclár

source: The number of hours should normally not be less than 15 per week
ga: Go hiondúil, ní cheart go mbeadh níos lú ná 15 uair an chloig teagaisc sa tseachtain i gceist

source: • Students should be placed in class according to competence and age and there should normally be no more than 15 students per class
ga: • Ba cheart dalta a chur i rang a oireann dá (h)aois agus dá c(h)umas agus ní cheart níos mó ná 15 dalta a bheith sa rang

source: • A complete schedule of supervised activities must form an essential part of all junior programmes
ga: • Caithfidh sceideal iomlán imeachtaí stiúrtha a bheith mar chuid riachtanach de gach clár sóisearach

source: • If it is appropriate, the school's courses should reflect Irish life and culture
ga: • Má tá sé feiliúnach, ba cheart saol na hÉireann agus an saol cultúrtha a bheith le braistint sna cúrsaí

source: • All teachers working in language schools must have a Level 7 degree and taken a recognised EFL certificate course
ga: • Caithfidh céim leibhéal 7 a bheith ag gach múinteoir ag obair i scoileanna teanga chomh maith le cúrsa teastais EFL aitheanta déanta acu

source: • The school must make sure that arrangements are in place for teacher induction and that ongoing teacher development is provided
ga: • Caithfidh na scoileanna déanamh cinnte go bhfuil socruithe i bhfeidhm le hinsealbhú múinteoirí agus forbairt leanúna na múinteoirí a chothú

source: • Each school must have a person with appropriate skills, experience and qualifications in the field of academic management to deal with the needs of the curriculum
ga: • Caithfidh duine le scileanna, taithí agus cáilíochtaí sa bhainistíocht acadúil a bheadh in ann déileáil le riachtanais an churaclaim a bheith i ngach scoil

source: This person must be available to students and staff during a normal working day
ga: Caithfidh an duine seo a bheith ar fáil d'fhoireann na scoile agus do na daltaí i gcaitheamh an lae oibre

source: • All information contained in advertising and promotional material (brochures, etc.) must be clear, accurate and verifiable
ga: • Caithfidh an t-eolas ar fad a bhíonn in aon ábhar fógraíochta (bróisiúir & rl) a bheith soiléir, cruinn agus fíor

source: • In circumstances where students are referred to other organisations for tuition, the organisations must be recognised by ACELS as an English Language Teaching Organisation
ga: • Nuair a chuirtear daltaí ar aghaidh chuig eagraíochtaí eile le haghaidh teagaisc, caithfidh aitheantas ón CCSTB le haghaidh Béarla a mhúineadh mar Theanga Iasachta a bheith ag an eagraíocht

source: ACELS may at any time withdraw recognition from an organisation
ga: D'fhéadfadh CCSTB aitheantas a bhaint ó eagraíocht ar bith

source: Refusal/withdrawal of recognition from one centre may, at the discretion of ACELS, lead to the refusal/withdrawal of recognition from an organisation as a whole
ga: Má bhaintear/má dhiúltaítear aitheantas d'ionad faoi leith, is féidir, le discréid CCSTB, aitheantas a bhaint/a dhiúltiú don eagraíocht ar fad

source: • Only centres that have been inspected by ACELS at specified addresses and for which recognition has been obtained can be advertised in publicity material claiming recognition by ACELS
ga: • Ní féidir le hionaid nach bhfuil scrúdaithe ag CCSTB ag seoltaí faoi leith agus nach bhfuil aitheantas faighte acu, fógraíocht a dhéanamh in ábhar poiblíochta ag rá go bhfuil aitheantas acu ón CCSTB

source: Requirements for host family accommodation
ga: Riachtanais do theaghlaigh a chuireann lóistín ar fáil

source: If accommodation is organised by the school, it must meet the required standards for host family accommodation or residential accommodation
ga: Má bhíonn an lóistín eagraithe ag an scoil, caithfidh sé caighdeán áirithe do theaghlaigh nó lóistín cónaithe a shroichint

source: The first requirement is that the student should be well looked after and treated as a member of the family during his or her stay
ga: Caithfear aire mhaith a thabhairt don dalta agus é/í a ligint a bheith mar pháirt den teaghlach agus é/í ag fanacht le teaghlach

source: The following facilities should be made available to the student:
ga: Caithfear na háiseanna seo a leanas a chur ar fáil don dalta:

source: • A comfortable bed with good supply of quality bedclothes and weekly change of bed linen
ga: • Leaba chompórdach le sóláthar maith d'éadach maith agus athrú éadaigh leapan uair sa tseachtain

source: • Adequate space for clothes storage
ga: • Dóthain spáis le haghaidh stóras éadaí

source: • Laundry or reasonable access to a washing machine
ga: • Níochán éadaí nó cead an meaisín níocháin a úsáid

source: • Table and chair in bedroom for private study or access at all times to another room with study facilities
ga: • Bord agus cathaoir don staidéar príobháideach sa seomra codlata nó a bheith in ann seomra eile a úsáid am ar bith le háiseanna staidéir

source: • Free access to a bathroom and bath or shower daily
ga: • Bheith in ann an seomra folctha a úsáid am ar bith agus folcadh nó cith folctha a bheith acu gach lá

source: • Adequate heating, lighting and ventilation
ga: • Teas, solas agus aerú ceart

source: Each host family can accommodate up to three students, but only one student of any particular mother tongue
ga: • Is féidir le gach teaghlach triúr dalta a choimeád, ach caithfidh teangacha difriúla ó dhúchas a bheith ag gach dalta

source: There should only be two students to a room at any time and a well-balanced and varied diet should be provided
ga: Ní cheart níos mó ná beirt a bheith in aon seomra amháin agus caithfear béilí éagsúla agus bia maith a shóláthar dóibh

source: EFL organisations offering residential programmes are required to have the accommodation approved by Fáilte Ireland - (the National Tourism Development Board for the island of Ireland)
ga: Caithfear aitheantas a fháil ó Bhord Fáilte chun an lóistín a chur ar fáil do na daltaí seo

source: Further details are available from ACELS and schools must carry out regular checks on the accommodation they provide for students
ga: Is féidir tuilleadh eolais a fháil ó CCSTB agus caithfidh na scoileanna na tithe lóistín a scrúdú go rialta

source: The purpose of TEFL courses is to familiarise candidates with current practices in teaching English as a foreign language
ga: Tá sé mar aidhm ag cúrsaí TEFL iarrathóirí a chur ar an eolas maidir le Béarla a mhúineadh mar theanga iasachta

source: Courses also instruct candidates how to construct and teach a series of lessons appropriate to the level and needs of language learners
ga: Faigheann iarrthóirí amach conas ceachtanna a ullmhú agus a mhúineadh ag an léibhéal cuí, ag brath ar riachtanais na ndaltaí

source: TEFL courses are run in many private schools and a number of universities
ga: Tá fáil ar chúrsaí TEFL i go leor scoileanna príobháideacha agus roinnt ollscoileanna

source: They range from basic introductory courses to courses designed to prepare candidates for the workplace
ga: Ar fáil, tá cúrsaí do thosaitheoirí chomh maith le cúrsaí a ullmhaíonn iarrthóirí don láthair oibre

source: More in-depth courses aimed at TEFL professionals interested in further professional development are also available from both private schools and universities
ga: Tá dianchúrsaí ar fáil chomh maith i scoileanna príobháideacha agus ollscoileanna do dhaoine le cáilíochtaí gairmiúla TEFL, ar spéis leo forbairt bhreise phroifisiúnta

source: Test of Interactive English
ga: Scrúdú ar Bhéarla Idirghníomhach

source: The Test of Interactive English (TIE) - for English language learners
ga: An Scrúdú ar Bhéarla Idirghníomhach (TIE) - a chruthú agus a chur i gcrích d'fhoghlaimeoirí an Bhéarla

source: The test is task-based, with the content chosen by each individual learner, and can therefore be used to assess learners with different needs, such as those learning English for business, academic or general purposes
ga: Mar sin, is féidir le foghlaimeoirí le riachtanais difriúla a mheas leis an scrúdú seo, ar nós daoine atá ag foghlaim Béarla le haghaidh cúrsaí gnó, ar bhonn acadúil nó ar bhonn ginearálta

source: Learners' communicative and interactive skills are tested in both predictable and spontaneous situations and they must complete both an oral and written exam
ga: Déantar scileanna cumarsáide agus idirghníomhacha na bhfoghlaimeoirí a mheas i gcásanna réamhinste chomh maith le cásanna toiliúla agus bíonn ar na foghlaimeoirí scrúdú béil agus scrúdú scríofa a dhéanamh freisin

source: The test is offered in two formats:
ga: Tá dhá scrúdú ann:

source: • The Junior TIE: for English language learners aged 12-18 years
ga: • An TIE Sóisearach: d'fhoghlaimeoirí an Bhéarla idir 12 agus 18 bliana d'aois

source: • The TIE: for English language learners of 18+ (post secondary)
ga: • An TIE: d'fhoghlaimeoirí an Bhéarla atá 18 bliana d'aois nó níos mó (tar éis meanscolaíochta)

source: After taking the TIE, each candidate is awarded a certificate, printed with the ACELS logo.The certificate also contains the sentence stating that TIE is recognised by ACELS, a service of QQI which is a statuatory body of the Department of Education and Skills
ga: Bronntar teastas ar gach iarrthóir tar éis an TIE a dhéanamh agus bíonn siombail na CCSTB clóbhuailte ar an teastas. Bíonn abairt ag rá go bhfuil an TIE aitheanta ag an Roinn Oideachais agus Scileanna scríofa ar an teastas chomh maith

source: Certificates are issued within 10 working days of the test having been taken
ga: Eisítear teastais taobh istigh de 10 lá tar éis an scrúdaithe a dhéanamh

source: Assessment of the TIE is given according to the Council of Europe's Common Framework Scale of Language Proficiency
ga: Déantar an TIE a mheas bunaithe ar Chomhscála Creatlaí Chomhairle na hEorpa ar Líofacht Teanga

source: MEI is an industry body, which represents the majority of recognised EFL schools in Ireland
ga: MEI - cumann tionscail a fheidhmíonn ar son formhór na scoileanna aitheanta EFL in Éirinn

source: All members of MEI are recognised and regulated by ACELS
ga: Tugann an Roinn Oideachais agus Scileanna aitheantas agus treorú do bhaill MEI tríd CCSTB

source: The functions of MEI can be defined by the following categories, each of which has a sub-committee made up from members of the association:
ga: Is féidir feidhmeanna MEI a shainmhíniú trí mheán na ranna seo a leanas, tá fo-choiste ag gach ceann atá déanta suas de bhaill den chumann:

source: Complaints about English language schools
ga: Gearáin faoi Scoil Bhéarla mar Theanga Iasachta

source: If you have any complaints about EFL schools, you should contact ACELS - see 'Where to apply' below, which is responsible for monitoring the standards in these schools
ga: Má bhíonn gearán le déanamh agat faoi scoil EFL, is féidir teangbháil a dhéanamh le CCSTB (féach ‘Cá háit a ndéanfaidh mé iarratas’ thíos), atá freagrach as caighdeáin na scoileanna seo a mheas

source: Information about fees for the application for the recognition of EFL organisations by ACELS are in the Regulations Governing the Recognition of English Language Teaching Organisations on the ACELS website
ga: Tá faisnéis faoi tháillí iarratais ar aitheantas ag an CCSTB sna Rialacháin Aitheantais Eagraíochtaí Teagaisc Bhéarla ar an suíomh gréasáin CCSTB

source: EFL organisations applying for recognition must send an official application form to ACELS before the stated deadline
ga: Caithfidh eagraíochtaí ar mhaith leo aitheantas a fháil, iarratas a sheoladh ar fhoirm iarratais oifigiúil chuig CCSTB roimh an sprioclá a bhíonn scríofa ar an bhfoirm

source: The Test of Interactive English is administered by TIE Examinations Ltd and applications are usually made through the candidates' language school or college
ga: Tá an Scrúdú ar Bhéarla Idirghníomhach riartha ag TIE agus de ghnáth déantar iarratas trí scoil nó coláiste teagaisc an iarrthóra

source: You can apply using the TIE application form (pdf) and you should make sure that your application is received a minimum of 10 days before the test date so that appropriate arrangements can be made
ga: Is féidir iarratas a dhéanamh ar fhoirm iarratais TIE (pdf) agus ba cheart a dhéanamh cinnte de go mbíonn d'iarratas istigh ar a laghad 10 lá roimh dháta an scrúdaithe, ionas gur féidir na socruithe cuí a dhéanamh
